""" 
AI闯关学习小程序

需求分析
目标：帮助大家更快速、更高效地学习新知识
背景：学习新的东西太过枯燥，现在有了ai我们可以利用AI自动通过
交互式问答闯关的方式，让用户更轻松地学习他想学的东西，
同时为了能随时随地的学习，我们可以做一个微信的小程序

选择WX小程序的原因：
1. 微信小程序的用户基数大，覆盖面广
2. 用户免安装，便于推广

本项目可以扩展为任何垂直领域的学习小程序（如驾考宝典、面试题库、企业培训题库、xx类知识学习）

人工需求分析：
核心功能 MVP（按照用户操作的核心业务流程设计）：
1、 用户可以选择自己想学习的知识（不限于一句话、一段话、一个文档/视频/网页）
2、 AI自动从全网或者特定的信息源获取知识（比如网络搜索、或者解析文档/视频/网页）
3、 AI自动生成交互式问答闯关的题目、选项和答案，通过提问引导来增加用户学习的趣味性
4、 用户可以自由答题闯关、每道题目选择后立刻给出正确答案和知识讲解（答错也有讲解）
5、 通关后生成一个知识总结和复盘报告，用户可以分享给好友
6、 用户可以在后台分析自己所学的知识和答题情况，便于日后复盘，还可以生成报告

扩展功能：
模式选择（基于用户之前学习过的内容生成问题，帮助用户复习之前的知识）
1、 允许输入知识库来生成题目（RAG）：可以用于企业培训、特定题库准备、考试复习等等
2、AI生图，比如应用到题目和选项中：可以根据知识的类型选择是否生成图片，可以用于刷英语单词等
3、充值vip进行盈利
4、多人闯关模式：可以和好友一起闯关，增加趣味性
"""

""" 
AI需求分析
让AI辅助需求分析和竞品调研，便于我们验证想法的可靠性、以及项目是否值得去做：
 """